In [1]:
import pandas as pd
import random

Write  a  Python  function  that  takes  a  DataFrame  containing 
transaction data and aggregates the total transaction amount per 
user.  The  DataFrame  has  columns  'user_id', ‘item_name’  and 
'transaction_amount'.

In [2]:
data = {
    'user_id':['1','2','3','4','5','6','1','2','3','4','5','6'],
    'item_name':['item1','item2','item3','item4','item5','item6','item1','item2','item3','item1','item2','item3'],
    'transaction_amount':[100.87,200.18,300.099,400.1,500.23,600.22,100.87,200.18,300.099,100.87,200.18,300.099]
}

df = pd.DataFrame(data)
df

   user_id item_name  transaction_amount
0        1     item1             100.870
1        2     item2             200.180
2        3     item3             300.099
3        4     item4             400.100
4        5     item5             500.230
5        6     item6             600.220
6        1     item1             100.870
7        2     item2             200.180
8        3     item3             300.099
9        4     item1             100.870
10       5     item2             200.180
11       6     item3             300.099

In [3]:
groupDf = df.groupby('user_id')
groupDf

In [4]:
for i,user in groupDf:
    sum = 0
    count = 0
    for i in range (len(user)):
        sum += user.iloc[i]['transaction_amount']
        count += 1
    print(f"user_id = {user.iloc[0]['user_id']} , average transaction = {sum/count}")

user_id = 1 , average transaction = 100.87
user_id = 2 , average transaction = 200.18
user_id = 3 , average transaction = 300.099
user_id = 4 , average transaction = 250.485
user_id = 5 , average transaction = 350.20500000000004
user_id = 6 , average transaction = 450.1595

In [5]:
groupDf.mean(numeric_only=True)

         transaction_amount
user_id
1                  100.8700
2                  200.1800
3                  300.0990
4                  250.4850
5                  350.2050
6                  450.1595

 Write a Python function that takes a DataFrame and returns a 
random sample of 10% of the rows. Ensure reproducibility by 
setting a random seed.

In [6]:
n = int(len(df)*0.1)
for i in range (n):
    i = random.randint(0,len(df)-1)
    print(df.loc[i])

user_id                    2
item_name              item2
transaction_amount    200.18
Name: 1, dtype: object

In [7]:
def sampledDf(df,seed):
    sampled_df = df.sample(frac=0.1, random_state=seed)
    print(sampled_df)

sampledDf(df,42)

   user_id item_name  transaction_amount
10       5     item2              200.18